Revit 2024 API
PartMaker.SetSourceElementIds Method
 Set the source elements for the PartMaker.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetSourceElementIds(
	ICollection<ElementId> sourceElementIds
)
Visual Basic
Public Sub SetSourceElementIds ( _
	sourceElementIds As ICollection(Of ElementId) _
)
Visual C++
public:
void SetSourceElementIds(
	ICollection<ElementId^>^ sourceElementIds
)
Parameters
sourceElementIds
Type: System.Collections.Generic.ICollection<ElementId>
 Elements to be the sources for this PartMaker.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  One or more element ids was not permitted to be a source for this PartMaker Elements should be Parts that have no PartMaker yet
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PartMaker Class
Autodesk.Revit.DB Namespace